play-telco-commonDataTaxi/TaxiUCTwitter.xml

 <soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><b:Notify xmlns:b="http://docs.oasis-open.org/wsn/b-2" xmlns:add="http://www.w3.org/2005/08/addressing"><b:NotificationMessage><b:Topic Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" xmlns:dsb="http://www.petalslink.org/dsb/topicsns/">dsb:TaxiUCTwitter</b:Topic><b:Message><OrangeLabsTaxiUC:TwitterEvent xmlns="http://www.orangelabs.org/DefTaxiEventType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:OrangeLabsTaxiUC="http://www.orangelabs.org/taxiEventTypes" xsi:schemaLocation="http://www.orangelabs.org/TaxiEventType TaxiEventType.xsd"><uniqueId>uId</uniqueId><sequenceNumber>sn</sequenceNumber><timeStamp>ts</timeStamp><twId>twid1</twId><message>mess1</message><status>online</status><latitude>1.1</latitude><longitude>2.2</longitude></OrangeLabsTaxiUC:TwitterEvent></b:Message></b:NotificationMessage></b:Notify></soapenv:Body></soapenv:Envelope>